; domain
; PDDL domain problem: NO axioms integration. The axioms have been COMPLETELY moved into the ASP file.

(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 S12 S13 S14 S15 S16 - secondary
	P17 P18 - primary
)
(:init
	(conn S1 P18)
	(conn S1 S2)
	(conn S2 S3)
	(conn S3 S4)
	(conn S4 S5)
	(conn S5 S6)
	(conn S6 S12)
	(conn S7 P17)
	(conn S7 S8)
	(conn S8 S9)
	(conn S9 S10)
	(conn S10 S11)
	(conn S10 S13)
	(conn S11 S12)
	(conn S13 S16)
	(conn S14 P18)
	(conn S14 S15)
	(conn S15 S16)
	(close S1 P18)
	(close S1 S2)
	(close S2 S3)
	(close S3 S4)
	(close S4 S5)
	(close S5 S6)
	(close S7 P17)
	(close S7 S8)
	(close S8 S9)
	(close S9 S10)
	(close S10 S11)
	(close S10 S13)
	(close S11 S12)
	(close S14 P18)
	(close S14 S15)
	(close S15 S16)
	(full S10)
	(buildable S1 S7)
	(buildable S4 S9)
	(buildable S5 P17)
	(buildable S8 P18)
	(buildable S8 S10)
	(buildable S11 S13)
	(mutable S1 P18)
	(mutable S4 S5)
	(mutable S7 S8)
	(mutable S8 S9)
	(mutable S10 S11)
	(mutable S10 S13)
	(le P17 P18)
	(le S1 P17)
	(le S1 P18)
	(le S1 S2)
	(le S1 S3)
	(le S1 S4)
	(le S1 S5)
	(le S1 S6)
	(le S1 S7)
	(le S1 S8)
	(le S1 S9)
	(le S1 S10)
	(le S1 S11)
	(le S1 S12)
	(le S1 S13)
	(le S1 S14)
	(le S1 S15)
	(le S1 S16)
	(le S2 P17)
	(le S2 P18)
	(le S2 S3)
	(le S2 S4)
	(le S2 S5)
	(le S2 S6)
	(le S2 S7)
	(le S2 S8)
	(le S2 S9)
	(le S2 S10)
	(le S2 S11)
	(le S2 S12)
	(le S2 S13)
	(le S2 S14)
	(le S2 S15)
	(le S2 S16)
	(le S3 P17)
	(le S3 P18)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S3 S7)
	(le S3 S8)
	(le S3 S9)
	(le S3 S10)
	(le S3 S11)
	(le S3 S12)
	(le S3 S13)
	(le S3 S14)
	(le S3 S15)
	(le S3 S16)
	(le S4 P17)
	(le S4 P18)
	(le S4 S5)
	(le S4 S6)
	(le S4 S7)
	(le S4 S8)
	(le S4 S9)
	(le S4 S10)
	(le S4 S11)
	(le S4 S12)
	(le S4 S13)
	(le S4 S14)
	(le S4 S15)
	(le S4 S16)
	(le S5 P17)
	(le S5 P18)
	(le S5 S6)
	(le S5 S7)
	(le S5 S8)
	(le S5 S9)
	(le S5 S10)
	(le S5 S11)
	(le S5 S12)
	(le S5 S13)
	(le S5 S14)
	(le S5 S15)
	(le S5 S16)
	(le S6 P17)
	(le S6 P18)
	(le S6 S7)
	(le S6 S8)
	(le S6 S9)
	(le S6 S10)
	(le S6 S11)
	(le S6 S12)
	(le S6 S13)
	(le S6 S14)
	(le S6 S15)
	(le S6 S16)
	(le S7 P17)
	(le S7 P18)
	(le S7 S8)
	(le S7 S9)
	(le S7 S10)
	(le S7 S11)
	(le S7 S12)
	(le S7 S13)
	(le S7 S14)
	(le S7 S15)
	(le S7 S16)
	(le S8 P17)
	(le S8 P18)
	(le S8 S9)
	(le S8 S10)
	(le S8 S11)
	(le S8 S12)
	(le S8 S13)
	(le S8 S14)
	(le S8 S15)
	(le S8 S16)
	(le S9 P17)
	(le S9 P18)
	(le S9 S10)
	(le S9 S11)
	(le S9 S12)
	(le S9 S13)
	(le S9 S14)
	(le S9 S15)
	(le S9 S16)
	(le S10 P17)
	(le S10 P18)
	(le S10 S11)
	(le S10 S12)
	(le S10 S13)
	(le S10 S14)
	(le S10 S15)
	(le S10 S16)
	(le S11 P17)
	(le S11 P18)
	(le S11 S12)
	(le S11 S13)
	(le S11 S14)
	(le S11 S15)
	(le S11 S16)
	(le S12 P17)
	(le S12 P18)
	(le S12 S13)
	(le S12 S14)
	(le S12 S15)
	(le S12 S16)
	(le S13 P17)
	(le S13 P18)
	(le S13 S14)
	(le S13 S15)
	(le S13 S16)
	(le S14 P17)
	(le S14 P18)
	(le S14 S15)
	(le S14 S16)
	(le S15 P17)
	(le S15 P18)
	(le S15 S16)
	(le S16 P17)
	(le S16 P18)
)
(:goal
	(and
		(conn S1 S2)
		(conn S1 S7)
		(conn S2 S3)
		(conn S3 S4)
		(conn S4 S9)
		(conn S5 P17)
		(conn S5 S6)
		(conn S6 S12)
		(conn S7 P17)
		(conn S8 P18)
		(conn S8 S10)
		(conn S9 S10)
		(conn S11 S12)
		(conn S11 S13)
		(conn S13 S16)
		(conn S14 P18)
		(conn S14 S15)
		(conn S15 S16)
		(not (conn S1 P18))
		(not (conn S4 S5))
		(not (conn S7 S8))
		(not (conn S8 S9))
		(not (conn S10 S11))
		(not (conn S10 S13))
		(close S1 S2)
		(close S1 S7)
		(close S2 S3)
		(close S3 S4)
		(close S5 P17)
		(close S5 S6)
		(close S6 S12)
		(close S7 P17)
		(close S8 P18)
		(close S8 S10)
		(close S9 S10)
		(close S11 S12)
		(close S11 S13)
		(close S13 S16)
		(close S14 P18)
		(close S14 S15)
		(not (close S4 S9))
		(not (close S15 S16))
	)
)
)

; plan
1. (insp s8 p18)
   added: (conn s8 p18) (full s8)
   goals met: 23 of 42
2. (sw s8 s7 p18)
   deleted: (close s7 s8)
   added: (close s8 p18)
   goals met: 24 of 42
3. (sw s16 s15 s13)
   deleted: (close s15 s16)
   added: (close s13 s16)
   goals met: 26 of 42
4. (inss s1 s7)
   added: (conn s1 s7) (full s1) (full s7)
   goals met: 27 of 42
5. (dels s7 s8)
   deleted: (conn s7 s8) (full s7) (full s8)
   added: (rem s7 s8)
   goals met: 28 of 42
6. (sw s1 p18 s7)
   deleted: (close s1 p18)
   added: (close s1 s7)
   goals met: 29 of 42
7. (delp s1 p18)
   deleted: (conn s1 p18) (full s1)
   added: (rem s1 p18)
   goals met: 30 of 42
8. (insp s5 p17)
   added: (conn s5 p17) (full s5)
   goals met: 31 of 42
9. (inss s4 s9)
   added: (conn s4 s9) (full s4) (full s9)
   goals met: 32 of 42
10. (sw s5 s4 p17)
   deleted: (close s4 s5)
   added: (close s5 p17)
   goals met: 33 of 42
11. (dels s4 s5)
   deleted: (conn s4 s5) (full s4) (full s5)
   added: (rem s4 s5)
   goals met: 34 of 42
12. (inss s11 s13)
   added: (conn s11 s13) (full s11) (full s13)
   goals met: 35 of 42
13. (sw s11 s10 s13)
   deleted: (close s10 s11)
   added: (close s11 s13)
   goals met: 36 of 42
14. (dels s10 s11)
   deleted: (conn s10 s11) (full s10) (full s11)
   added: (rem s10 s11)
   goals met: 37 of 42
15. (inss s8 s10)
   added: (conn s8 s10) (full s8) (full s10)
   goals met: 38 of 42
16. (sw s8 s9 s10)
   deleted: (close s8 s9)
   added: (close s8 s10)
   goals met: 39 of 42
17. (dels s8 s9)
   deleted: (conn s8 s9) (full s8) (full s9)
   added: (rem s8 s9)
   goals met: 40 of 42
18. (sw s12 s11 s6)
   deleted: (close s11 s12)
   added: (close s6 s12)
   goals met: 40 of 42
19. (sw s11 s13 s12)
   deleted: (close s11 s13)
   added: (close s11 s12)
   goals met: 40 of 42
20. (sw s13 s10 s11)
   deleted: (close s10 s13)
   added: (close s11 s13)
   goals met: 41 of 42
21. (dels s10 s13)
   deleted: (conn s10 s13) (full s10) (full s13)
   added: (rem s10 s13)
   goals met: 42 of 42
